modules/adwords_axis/src/test/java/com/google/api/ads/adwords/axis/testing/test_request_oauth2.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Header>
    <ns1:RequestHeader soapenv:mustUnderstand="0" xmlns:ns1="https://adwords.google.com/api/adwords/cm/#API_VERSION#">
        <ns1:clientCustomerId>TEST_CLIENT_CUSTOMER_ID</ns1:clientCustomerId>
        <ns1:developerToken>TEST_DEVELOPER_TOKEN</ns1:developerToken>
        <ns1:userAgent>TEST_APP (AwApi-Java, AdWords-Axis/4.3.0, Common-Java/4.3.0, Axis/1.4, Java/#JAVA_VERSION#, maven)</ns1:userAgent>
        <ns1:validateOnly>false</ns1:validateOnly>
        <ns1:partialFailure>false</ns1:partialFailure>
    </ns1:RequestHeader>
  </soapenv:Header>
  <soapenv:Body>
    <mutate xmlns="https://adwords.google.com/api/adwords/cm/#API_VERSION#">
      <operations>
        <operator>ADD</operator>
        <operand>
          <name>Test Budget Name</name>
          <amount>
            <microAmount>50000000</microAmount>
          </amount>
          <deliveryMethod>STANDARD</deliveryMethod>
        </operand>
      </operations>
    </mutate>
  </soapenv:Body>
</soapenv:Envelope>